app/controllers/items_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["user_id", 4], ["created_at", "2017-06-11 02:53:50.668698"], ["updated_at", "2017-06-11 02:53:50.668698"]]
---
  def create
    @user = User.find(params[:user_id])
    @item = current_user.items.create(item_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 11]]
---
  def destroy
    @user = User.find(params[:user_id])
    @item = Item.find(params[:id])
    @item.destroy